# Use Case

##Actor

- **Gym гишүүн**
- **Дасгалжуулагч**
- **Gym менежер**
- **QR төхөөрөмж / Device**
- **Урамшууллын систем**

---

## Use Cases

### **Gym гишүүн**
- Аппликейшнд нэвтрэх  
- Төхөөрөмж дээрх QR код уншуулах  
- Хийх дасгалаа сонгох  
- Дасгал эхлүүлэх  
- Сет дуусгаад жин, давталт оруулах  
- Өдрийн гүйцэтгэлээ хадгалах  
- Ахиц, статистик, XP оноо харах  
- Лидерборд дээр байрлалаа шалгах  
- XP оноогоо шагналд ашиглах  

---

### **Дасгалжуулагч**
- Гишүүний өдрийн төлөвлөгөө үүсгэх  
- Дасгалын дараалал, зорилтот жин тодорхойлох  
- Гишүүний гүйцэтгэлийг хянах  
- Зөвлөгөө, аюулгүй байдлын тайлбар үлдээх  
- Төхөөрөмж дээрх дасгалуудыг шалгаж засварлах  

---

### **Gym менежер**
- Шинэ төхөөрөмж бүртгэх  
- Төхөөрөмжид тохирох дасгалуудын жагсаалт бүртгэх  
- Дасгалжуулагчдад эрх олгох  
- Ирц ба төхөөрөмжийн ашиглалтын тайлан харах  
- Лидербордоос идэвхтэй гишүүдийг тодруулах  

---

### **QR төхөөрөмж / Device**
- Төхөөрөмжийн ID илгээж баталгаажуулах  
- Дасгал эхэлсэн, дууссан мэдээлэл дамжуулах  

---

### **Урамшууллын систем**
- XP оноог шагналд хөрвүүлэх  
- Хөнгөлөлт, купон үүсгэх  
